MikroElektronika/core_packages/PIC/XC8/def/PIC16C765/mcu.h
extern volatile UEP1bits_t UEP1bits __at(0x199);
// bitfield macros
#define _UEP1_EP_STALL_POSN                                 0x0
#define _UEP1_EP_STALL_POSITION                             0x0
#define _UEP1_EP_STALL_SIZE                                 0x1
#define _UEP1_EP_STALL_LENGTH                               0x1
#define _UEP1_EP_STALL_MASK                                 0x1
#define _UEP1_EP_IN_EN_POSN                                 0x1
#define _UEP1_EP_IN_EN_POSITION                             0x1
#define _UEP1_EP_IN_EN_SIZE                                 0x1
#define _UEP1_EP_IN_EN_LENGTH                               0x1
#define _UEP1_EP_IN_EN_MASK                                 0x2
#define _UEP1_EP_OUT_EN_POSN                                0x2
#define _UEP1_EP_OUT_EN_POSITION                            0x2
#define _UEP1_EP_OUT_EN_SIZE                                0x1
#define _UEP1_EP_OUT_EN_LENGTH                              0x1
#define _UEP1_EP_OUT_EN_MASK                                0x4
#define _UEP1_EP_CTL_DIS_POSN                               0x3
#define _UEP1_EP_CTL_DIS_POSITION                           0x3
#define _UEP1_EP_CTL_DIS_SIZE                               0x1
#define _UEP1_EP_CTL_DIS_LENGTH                             0x1
#define _UEP1_EP_CTL_DIS_MASK                               0x8

// Register: UEP2
#define UEP2 UEP2
extern volatile unsigned char           UEP2                __at(0x19A);
#ifndef _LIB_BUILD
asm("UEP2 equ 019Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EP_STALL               :1;
        unsigned EP_IN_EN               :1;
        unsigned EP_OUT_EN              :1;
        unsigned EP_CTL_DIS             :1;
    };
} UEP2bits_t;
extern volatile UEP2bits_t UEP2bits __at(0x19A);
// bitfield macros
#define _UEP2_EP_STALL_POSN                                 0x0
#define _UEP2_EP_STALL_POSITION                             0x0
#define _UEP2_EP_STALL_SIZE                                 0x1
#define _UEP2_EP_STALL_LENGTH                               0x1
#define _UEP2_EP_STALL_MASK                                 0x1
#define _UEP2_EP_IN_EN_POSN                                 0x1
#define _UEP2_EP_IN_EN_POSITION                             0x1
#define _UEP2_EP_IN_EN_SIZE                                 0x1
#define _UEP2_EP_IN_EN_LENGTH                               0x1
#define _UEP2_EP_IN_EN_MASK                                 0x2
#define _UEP2_EP_OUT_EN_POSN                                0x2
#define _UEP2_EP_OUT_EN_POSITION                            0x2
#define _UEP2_EP_OUT_EN_SIZE                                0x1
#define _UEP2_EP_OUT_EN_LENGTH                              0x1
#define _UEP2_EP_OUT_EN_MASK                                0x4
#define _UEP2_EP_CTL_DIS_POSN                               0x3
#define _UEP2_EP_CTL_DIS_POSITION                           0x3
#define _UEP2_EP_CTL_DIS_SIZE                               0x1
#define _UEP2_EP_CTL_DIS_LENGTH                             0x1
#define _UEP2_EP_CTL_DIS_MASK                               0x8

// Register: BD0OST
#define BD0OST BD0OST
extern volatile unsigned char           BD0OST              __at(0x1A0);
#ifndef _LIB_BUILD
asm("BD0OST equ 01A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD0OSTbits_t;
extern volatile BD0OSTbits_t BD0OSTbits __at(0x1A0);
// bitfield macros
#define _BD0OST_PID0_BSTALL_POSN                            0x2
#define _BD0OST_PID0_BSTALL_POSITION                        0x2
#define _BD0OST_PID0_BSTALL_SIZE                            0x1
#define _BD0OST_PID0_BSTALL_LENGTH                          0x1
#define _BD0OST_PID0_BSTALL_MASK                            0x4
#define _BD0OST_PID1_DTS_POSN                               0x3
#define _BD0OST_PID1_DTS_POSITION                           0x3
#define _BD0OST_PID1_DTS_SIZE                               0x1
#define _BD0OST_PID1_DTS_LENGTH                             0x1
#define _BD0OST_PID1_DTS_MASK                               0x8
#define _BD0OST_PID2_POSN                                   0x4
#define _BD0OST_PID2_POSITION                               0x4
#define _BD0OST_PID2_SIZE                                   0x1
#define _BD0OST_PID2_LENGTH                                 0x1
#define _BD0OST_PID2_MASK                                   0x10
#define _BD0OST_PID3_POSN                                   0x5
#define _BD0OST_PID3_POSITION                               0x5
#define _BD0OST_PID3_SIZE                                   0x1
#define _BD0OST_PID3_LENGTH                                 0x1
#define _BD0OST_PID3_MASK                                   0x20
#define _BD0OST_DATA0_1_POSN                                0x6
#define _BD0OST_DATA0_1_POSITION                            0x6
#define _BD0OST_DATA0_1_SIZE                                0x1
#define _BD0OST_DATA0_1_LENGTH                              0x1
#define _BD0OST_DATA0_1_MASK                                0x40
#define _BD0OST_UOWN_POSN                                   0x7
#define _BD0OST_UOWN_POSITION                               0x7
#define _BD0OST_UOWN_SIZE                                   0x1
#define _BD0OST_UOWN_LENGTH                                 0x1
#define _BD0OST_UOWN_MASK                                   0x80
#define _BD0OST_PID0_POSN                                   0x2
#define _BD0OST_PID0_POSITION                               0x2
#define _BD0OST_PID0_SIZE                                   0x1
#define _BD0OST_PID0_LENGTH                                 0x1
#define _BD0OST_PID0_MASK                                   0x4
#define _BD0OST_PID1_POSN                                   0x3
#define _BD0OST_PID1_POSITION                               0x3
#define _BD0OST_PID1_SIZE                                   0x1
#define _BD0OST_PID1_LENGTH                                 0x1
#define _BD0OST_PID1_MASK                                   0x8
#define _BD0OST_DATA01_POSN                                 0x6
#define _BD0OST_DATA01_POSITION                             0x6
#define _BD0OST_DATA01_SIZE                                 0x1
#define _BD0OST_DATA01_LENGTH                               0x1
#define _BD0OST_DATA01_MASK                                 0x40
#define _BD0OST_OWN_POSN                                    0x7
#define _BD0OST_OWN_POSITION                                0x7
#define _BD0OST_OWN_SIZE                                    0x1
#define _BD0OST_OWN_LENGTH                                  0x1
#define _BD0OST_OWN_MASK                                    0x80
#define _BD0OST_BSTALL_POSN                                 0x2
#define _BD0OST_BSTALL_POSITION                             0x2
#define _BD0OST_BSTALL_SIZE                                 0x1
#define _BD0OST_BSTALL_LENGTH                               0x1
#define _BD0OST_BSTALL_MASK                                 0x4
#define _BD0OST_DTS_POSN                                    0x3
#define _BD0OST_DTS_POSITION                                0x3
#define _BD0OST_DTS_SIZE                                    0x1
#define _BD0OST_DTS_LENGTH                                  0x1
#define _BD0OST_DTS_MASK                                    0x8

// Register: BD0OBC
#define BD0OBC BD0OBC
extern volatile unsigned char           BD0OBC              __at(0x1A1);
#ifndef _LIB_BUILD
asm("BD0OBC equ 01A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD0OBCbits_t;
extern volatile BD0OBCbits_t BD0OBCbits __at(0x1A1);
// bitfield macros
#define _BD0OBC_BC_POSN                                     0x0
#define _BD0OBC_BC_POSITION                                 0x0
#define _BD0OBC_BC_SIZE                                     0x4
#define _BD0OBC_BC_LENGTH                                   0x4
#define _BD0OBC_BC_MASK                                     0xF
#define _BD0OBC_BC0_POSN                                    0x0
#define _BD0OBC_BC0_POSITION                                0x0
#define _BD0OBC_BC0_SIZE                                    0x1
#define _BD0OBC_BC0_LENGTH                                  0x1
#define _BD0OBC_BC0_MASK                                    0x1
#define _BD0OBC_BC1_POSN                                    0x1
#define _BD0OBC_BC1_POSITION                                0x1
#define _BD0OBC_BC1_SIZE                                    0x1
#define _BD0OBC_BC1_LENGTH                                  0x1
#define _BD0OBC_BC1_MASK                                    0x2
#define _BD0OBC_BC2_POSN                                    0x2
#define _BD0OBC_BC2_POSITION                                0x2
#define _BD0OBC_BC2_SIZE                                    0x1
#define _BD0OBC_BC2_LENGTH                                  0x1
#define _BD0OBC_BC2_MASK                                    0x4
#define _BD0OBC_BC3_POSN                                    0x3
#define _BD0OBC_BC3_POSITION                                0x3
#define _BD0OBC_BC3_SIZE                                    0x1
#define _BD0OBC_BC3_LENGTH                                  0x1
#define _BD0OBC_BC3_MASK                                    0x8

// Register: BD0OAL
#define BD0OAL BD0OAL
extern volatile unsigned char           BD0OAL              __at(0x1A2);
#ifndef _LIB_BUILD
asm("BD0OAL equ 01A2h");
#endif

// Register: BD0IST
#define BD0IST BD0IST
extern volatile unsigned char           BD0IST              __at(0x1A4);
#ifndef _LIB_BUILD
asm("BD0IST equ 01A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD0ISTbits_t;
extern volatile BD0ISTbits_t BD0ISTbits __at(0x1A4);
// bitfield macros
#define _BD0IST_PID0_BSTALL_POSN                            0x2
#define _BD0IST_PID0_BSTALL_POSITION                        0x2
#define _BD0IST_PID0_BSTALL_SIZE                            0x1
#define _BD0IST_PID0_BSTALL_LENGTH                          0x1
#define _BD0IST_PID0_BSTALL_MASK                            0x4
#define _BD0IST_PID1_DTS_POSN                               0x3
#define _BD0IST_PID1_DTS_POSITION                           0x3
#define _BD0IST_PID1_DTS_SIZE                               0x1
#define _BD0IST_PID1_DTS_LENGTH                             0x1
#define _BD0IST_PID1_DTS_MASK                               0x8
#define _BD0IST_PID2_POSN                                   0x4
#define _BD0IST_PID2_POSITION                               0x4
#define _BD0IST_PID2_SIZE                                   0x1
#define _BD0IST_PID2_LENGTH                                 0x1
#define _BD0IST_PID2_MASK                                   0x10
#define _BD0IST_PID3_POSN                                   0x5
#define _BD0IST_PID3_POSITION                               0x5
#define _BD0IST_PID3_SIZE                                   0x1
#define _BD0IST_PID3_LENGTH                                 0x1
#define _BD0IST_PID3_MASK                                   0x20
#define _BD0IST_DATA0_1_POSN                                0x6
#define _BD0IST_DATA0_1_POSITION                            0x6
#define _BD0IST_DATA0_1_SIZE                                0x1
#define _BD0IST_DATA0_1_LENGTH                              0x1
#define _BD0IST_DATA0_1_MASK                                0x40
#define _BD0IST_UOWN_POSN                                   0x7
#define _BD0IST_UOWN_POSITION                               0x7
#define _BD0IST_UOWN_SIZE                                   0x1
#define _BD0IST_UOWN_LENGTH                                 0x1
#define _BD0IST_UOWN_MASK                                   0x80
#define _BD0IST_PID0_POSN                                   0x2
#define _BD0IST_PID0_POSITION                               0x2
#define _BD0IST_PID0_SIZE                                   0x1
#define _BD0IST_PID0_LENGTH                                 0x1
#define _BD0IST_PID0_MASK                                   0x4
#define _BD0IST_PID1_POSN                                   0x3
#define _BD0IST_PID1_POSITION                               0x3
#define _BD0IST_PID1_SIZE                                   0x1
#define _BD0IST_PID1_LENGTH                                 0x1
#define _BD0IST_PID1_MASK                                   0x8
#define _BD0IST_DATA01_POSN                                 0x6
#define _BD0IST_DATA01_POSITION                             0x6
#define _BD0IST_DATA01_SIZE                                 0x1
#define _BD0IST_DATA01_LENGTH                               0x1
#define _BD0IST_DATA01_MASK                                 0x40
#define _BD0IST_OWN_POSN                                    0x7
#define _BD0IST_OWN_POSITION                                0x7
#define _BD0IST_OWN_SIZE                                    0x1
#define _BD0IST_OWN_LENGTH                                  0x1
#define _BD0IST_OWN_MASK                                    0x80
#define _BD0IST_BSTALL_POSN                                 0x2
#define _BD0IST_BSTALL_POSITION                             0x2
#define _BD0IST_BSTALL_SIZE                                 0x1
#define _BD0IST_BSTALL_LENGTH                               0x1
#define _BD0IST_BSTALL_MASK                                 0x4
#define _BD0IST_DTS_POSN                                    0x3
#define _BD0IST_DTS_POSITION                                0x3
#define _BD0IST_DTS_SIZE                                    0x1
#define _BD0IST_DTS_LENGTH                                  0x1
#define _BD0IST_DTS_MASK                                    0x8

// Register: BD0IBC
#define BD0IBC BD0IBC
extern volatile unsigned char           BD0IBC              __at(0x1A5);
#ifndef _LIB_BUILD
asm("BD0IBC equ 01A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD0IBCbits_t;
