MikroElektronika/core_packages/PIC/XC8/def/PIC16C765/mcu.h
// Register: BD1OAL
#define BD1OAL BD1OAL
extern volatile unsigned char           BD1OAL              __at(0x1AA);
#ifndef _LIB_BUILD
asm("BD1OAL equ 01AAh");
#endif

// Register: BD1IST
#define BD1IST BD1IST
extern volatile unsigned char           BD1IST              __at(0x1AC);
#ifndef _LIB_BUILD
asm("BD1IST equ 01ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD1ISTbits_t;
extern volatile BD1ISTbits_t BD1ISTbits __at(0x1AC);
// bitfield macros
#define _BD1IST_PID0_BSTALL_POSN                            0x2
#define _BD1IST_PID0_BSTALL_POSITION                        0x2
#define _BD1IST_PID0_BSTALL_SIZE                            0x1
#define _BD1IST_PID0_BSTALL_LENGTH                          0x1
#define _BD1IST_PID0_BSTALL_MASK                            0x4
#define _BD1IST_PID1_DTS_POSN                               0x3
#define _BD1IST_PID1_DTS_POSITION                           0x3
#define _BD1IST_PID1_DTS_SIZE                               0x1
#define _BD1IST_PID1_DTS_LENGTH                             0x1
#define _BD1IST_PID1_DTS_MASK                               0x8
#define _BD1IST_PID2_POSN                                   0x4
#define _BD1IST_PID2_POSITION                               0x4
#define _BD1IST_PID2_SIZE                                   0x1
#define _BD1IST_PID2_LENGTH                                 0x1
#define _BD1IST_PID2_MASK                                   0x10
#define _BD1IST_PID3_POSN                                   0x5
#define _BD1IST_PID3_POSITION                               0x5
#define _BD1IST_PID3_SIZE                                   0x1
#define _BD1IST_PID3_LENGTH                                 0x1
#define _BD1IST_PID3_MASK                                   0x20
#define _BD1IST_DATA0_1_POSN                                0x6
#define _BD1IST_DATA0_1_POSITION                            0x6
#define _BD1IST_DATA0_1_SIZE                                0x1
#define _BD1IST_DATA0_1_LENGTH                              0x1
#define _BD1IST_DATA0_1_MASK                                0x40
#define _BD1IST_UOWN_POSN                                   0x7
#define _BD1IST_UOWN_POSITION                               0x7
#define _BD1IST_UOWN_SIZE                                   0x1
#define _BD1IST_UOWN_LENGTH                                 0x1
#define _BD1IST_UOWN_MASK                                   0x80
#define _BD1IST_PID0_POSN                                   0x2
#define _BD1IST_PID0_POSITION                               0x2
#define _BD1IST_PID0_SIZE                                   0x1
#define _BD1IST_PID0_LENGTH                                 0x1
#define _BD1IST_PID0_MASK                                   0x4
#define _BD1IST_PID1_POSN                                   0x3
#define _BD1IST_PID1_POSITION                               0x3
#define _BD1IST_PID1_SIZE                                   0x1
#define _BD1IST_PID1_LENGTH                                 0x1
#define _BD1IST_PID1_MASK                                   0x8
#define _BD1IST_DATA01_POSN                                 0x6
#define _BD1IST_DATA01_POSITION                             0x6
#define _BD1IST_DATA01_SIZE                                 0x1
#define _BD1IST_DATA01_LENGTH                               0x1
#define _BD1IST_DATA01_MASK                                 0x40
#define _BD1IST_OWN_POSN                                    0x7
#define _BD1IST_OWN_POSITION                                0x7
#define _BD1IST_OWN_SIZE                                    0x1
#define _BD1IST_OWN_LENGTH                                  0x1
#define _BD1IST_OWN_MASK                                    0x80
#define _BD1IST_BSTALL_POSN                                 0x2
#define _BD1IST_BSTALL_POSITION                             0x2
#define _BD1IST_BSTALL_SIZE                                 0x1
#define _BD1IST_BSTALL_LENGTH                               0x1
#define _BD1IST_BSTALL_MASK                                 0x4
#define _BD1IST_DTS_POSN                                    0x3
#define _BD1IST_DTS_POSITION                                0x3
#define _BD1IST_DTS_SIZE                                    0x1
#define _BD1IST_DTS_LENGTH                                  0x1
#define _BD1IST_DTS_MASK                                    0x8

// Register: BD1IBC
#define BD1IBC BD1IBC
extern volatile unsigned char           BD1IBC              __at(0x1AD);
#ifndef _LIB_BUILD
asm("BD1IBC equ 01ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BC                     :4;
    };
    struct {
        unsigned BC0                    :1;
        unsigned BC1                    :1;
        unsigned BC2                    :1;
        unsigned BC3                    :1;
    };
} BD1IBCbits_t;
extern volatile BD1IBCbits_t BD1IBCbits __at(0x1AD);
// bitfield macros
#define _BD1IBC_BC_POSN                                     0x0
#define _BD1IBC_BC_POSITION                                 0x0
#define _BD1IBC_BC_SIZE                                     0x4
#define _BD1IBC_BC_LENGTH                                   0x4
#define _BD1IBC_BC_MASK                                     0xF
#define _BD1IBC_BC0_POSN                                    0x0
#define _BD1IBC_BC0_POSITION                                0x0
#define _BD1IBC_BC0_SIZE                                    0x1
#define _BD1IBC_BC0_LENGTH                                  0x1
#define _BD1IBC_BC0_MASK                                    0x1
#define _BD1IBC_BC1_POSN                                    0x1
#define _BD1IBC_BC1_POSITION                                0x1
#define _BD1IBC_BC1_SIZE                                    0x1
#define _BD1IBC_BC1_LENGTH                                  0x1
#define _BD1IBC_BC1_MASK                                    0x2
#define _BD1IBC_BC2_POSN                                    0x2
#define _BD1IBC_BC2_POSITION                                0x2
#define _BD1IBC_BC2_SIZE                                    0x1
#define _BD1IBC_BC2_LENGTH                                  0x1
#define _BD1IBC_BC2_MASK                                    0x4
#define _BD1IBC_BC3_POSN                                    0x3
#define _BD1IBC_BC3_POSITION                                0x3
#define _BD1IBC_BC3_SIZE                                    0x1
#define _BD1IBC_BC3_LENGTH                                  0x1
#define _BD1IBC_BC3_MASK                                    0x8

// Register: BD1IAL
#define BD1IAL BD1IAL
extern volatile unsigned char           BD1IAL              __at(0x1AE);
#ifndef _LIB_BUILD
asm("BD1IAL equ 01AEh");
#endif

// Register: BD2OST
#define BD2OST BD2OST
extern volatile unsigned char           BD2OST              __at(0x1B0);
#ifndef _LIB_BUILD
asm("BD2OST equ 01B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PID0_BSTALL            :1;
        unsigned PID1_DTS               :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned DATA0_1                :1;
        unsigned UOWN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned                        :2;
        unsigned DATA01                 :1;
        unsigned OWN                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned BSTALL                 :1;
        unsigned DTS                    :1;
    };
} BD2OSTbits_t;
extern volatile BD2OSTbits_t BD2OSTbits __at(0x1B0);
// bitfield macros
#define _BD2OST_PID0_BSTALL_POSN                            0x2
#define _BD2OST_PID0_BSTALL_POSITION                        0x2
#define _BD2OST_PID0_BSTALL_SIZE                            0x1
#define _BD2OST_PID0_BSTALL_LENGTH                          0x1
#define _BD2OST_PID0_BSTALL_MASK                            0x4
#define _BD2OST_PID1_DTS_POSN                               0x3
#define _BD2OST_PID1_DTS_POSITION                           0x3
#define _BD2OST_PID1_DTS_SIZE                               0x1
#define _BD2OST_PID1_DTS_LENGTH                             0x1
#define _BD2OST_PID1_DTS_MASK                               0x8
#define _BD2OST_PID2_POSN                                   0x4
#define _BD2OST_PID2_POSITION                               0x4
#define _BD2OST_PID2_SIZE                                   0x1
#define _BD2OST_PID2_LENGTH                                 0x1
#define _BD2OST_PID2_MASK                                   0x10
#define _BD2OST_PID3_POSN                                   0x5
#define _BD2OST_PID3_POSITION                               0x5
#define _BD2OST_PID3_SIZE                                   0x1
#define _BD2OST_PID3_LENGTH                                 0x1
#define _BD2OST_PID3_MASK                                   0x20
#define _BD2OST_DATA0_1_POSN                                0x6
#define _BD2OST_DATA0_1_POSITION                            0x6
#define _BD2OST_DATA0_1_SIZE                                0x1
#define _BD2OST_DATA0_1_LENGTH                              0x1
#define _BD2OST_DATA0_1_MASK                                0x40
#define _BD2OST_UOWN_POSN                                   0x7
#define _BD2OST_UOWN_POSITION                               0x7
#define _BD2OST_UOWN_SIZE                                   0x1
#define _BD2OST_UOWN_LENGTH                                 0x1
#define _BD2OST_UOWN_MASK                                   0x80
#define _BD2OST_PID0_POSN                                   0x2
#define _BD2OST_PID0_POSITION                               0x2
#define _BD2OST_PID0_SIZE                                   0x1
#define _BD2OST_PID0_LENGTH                                 0x1
#define _BD2OST_PID0_MASK                                   0x4
#define _BD2OST_PID1_POSN                                   0x3
#define _BD2OST_PID1_POSITION                               0x3
#define _BD2OST_PID1_SIZE                                   0x1
#define _BD2OST_PID1_LENGTH                                 0x1
#define _BD2OST_PID1_MASK                                   0x8
#define _BD2OST_DATA01_POSN                                 0x6
#define _BD2OST_DATA01_POSITION                             0x6
#define _BD2OST_DATA01_SIZE                                 0x1
#define _BD2OST_DATA01_LENGTH                               0x1
#define _BD2OST_DATA01_MASK                                 0x40
#define _BD2OST_OWN_POSN                                    0x7
#define _BD2OST_OWN_POSITION                                0x7
#define _BD2OST_OWN_SIZE                                    0x1
#define _BD2OST_OWN_LENGTH                                  0x1
#define _BD2OST_OWN_MASK                                    0x80
#define _BD2OST_BSTALL_POSN                                 0x2
#define _BD2OST_BSTALL_POSITION                             0x2
#define _BD2OST_BSTALL_SIZE                                 0x1
#define _BD2OST_BSTALL_LENGTH                               0x1
#define _BD2OST_BSTALL_MASK                                 0x4
#define _BD2OST_DTS_POSN                                    0x3
#define _BD2OST_DTS_POSITION                                0x3
#define _BD2OST_DTS_SIZE                                    0x1
#define _BD2OST_DTS_LENGTH                                  0x1
#define _BD2OST_DTS_MASK                                    0x8

